---
kind: other
id: Methods.T:Autodesk.Revit.DB.CombinableElementArray
source: html/eb1de32c-29c7-eec2-14d3-04f047a6f840.htm
---
# CombinableElementArray Methods

Add the element to the end of the array.